be
have
do
say
get
make
go
see
know
take
think
come
give
look
use
find
want
tell
put
mean
become
leave
work
need
feel
seem
ask
show
try
call
keep
provide
hold
turn
follow
begin
bring
like
going
help
start
run
write
set
move
play
pay
hear
include
believe
allow
meet
lead
live
stand
happen
carry
talk
appear
produce
sit
offer
consider
expect
suggest
let
read
require
continue
lose
add
change
fall
remain
remember
buy
speak
stop
send
receive
decide
win
understand
describe
develop
agree
open
reach
build
involve
spend
return
draw
die
hope
create
walk
sell
wait
cause
pass
lie
accept
watch
raise
base
apply
break
explain
learn
increase
cover
grow
claim
report
support
cut
form
stay
contain
reduce
establish
join
wish
achieve
seek
choose
deal
face
fail
serve
end
kill
occur
drive
represent
rise
discuss
love
pick
place
argue
prove
wear
catch
enjoy
eat
introduce
enter
present
arrive
ensure
point
plan
pull
refer
act
relate
affect
close
identify
manage
thank
compare
announce
obtain
note
forget
indicate
wonder
maintain
publish
suffer
avoid
express
suppose
finish
determine
design
listen
save
tend
treat
control
share
remove
throw
visit
exist
encourage
force
reflect
admit
assume
smile
prepare
replace
fill
improve
mention
fight
intend
miss
discover
drop
hit
push
prevent
refuse
regard
lay
reveal
teach
answer
operate
state
depend
enable
record
check
complete
cost
sound
laugh
realise
extend
arise
notice
define
examine
fit
study
bear
hang
recognise
shake
sign
attend
fly
gain
perform
result
travel
adopt
confirm
protect
demand
stare
imagine
attempt
beat
born
associate
care
marry
collect
voice
employ
issue
release
emerge
mind
aim
deny
mark
shoot
appoint
order
supply
drink
observe
reply
ignore
link
propose
ring
settle
strike
press
respond
arrange
survive
concentrate
lift
approach
cross
test
charge
experience
touch
acquire
commit
demonstrate
grant
prefer
repeat
sleep
threaten
feed
insist
launch
limit
promote
deliver
measure
own
retain
assess
attract
belong
consist
contribute
hide
promise
reject
cry
impose
invite
sing
vary
warn
address
declare
destroy
worry
divide
head
name
stick
nod
recognize
train
attack
clear
combine
handle
influence
realize
recommend
shout
spread
undertake
account
select
climb
contact
recall
secure
step
transfer
welcome
conclude
disappear
display
dress
illustrate
imply
organise
direct
escape
generate
investigate
remind
advise
afford
earn
hand
inform
rely
succeed
approve
burn
fear
vote
conduct
cope
derive
elect
gather
jump
last
match
matter
persuade
ride
shut
blow
estimate
recover
score
slip
count
hate
attach
exercise
house
lean
roll
wash
accompany
accuse
bind
explore
judge
rest
steal
comment
exclude
focus
hurt
stretch
withdraw
back
fix
justify
knock
pursue
switch
appreciate
benefit
lack
list
occupy
permit
surround
abandon
blame
complain
connect
construct
dominate
engage
paint
quote
view
acknowledge
dismiss
incorporate
interpret
proceed
search
separate
stress
alter
analyse
arrest
bother
defend
expand
implement
possess
review
suit
tie
assist
calculate
glance
mix
question
resolve
rule
suspect
wake
appeal
challenge
clean
damage
guess
reckon
restore
restrict
specify
constitute
convert
distinguish
submit
trust
urge
feature
land
locate
predict
preserve
solve
sort
struggle
cast
cook
dance
invest
lock
owe
pour
shift
kick
kiss
light
purchase
race
retire
