{
  "source": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
  "title": "Apple MacBook Pro 16-inch (2021) review",
  "category": "computing",
  "updated": "2021-12-01T14:32:30Z",
  "author": "matt-hanson",
  "summary": "Another powerful winner from Apple",
  "verdict": "The MacBook Pro 16-inch (2021) is one of the best laptops creative professionals can buy, thanks to its brilliant performance, stunning screen and long battery life. However, it is large and heavy, which is why the 14-inch MacBook Pro may be a better buy, unless you want the larger screen and longer battery life.",
  "pros": [
    "Excellent performance",
    "Stunning mini-LED display",
    "Extremely long battery life",
    "Plenty of ports"
  ],
  "cons": [
    "Large",
    "Heavy",
    "Expensive"
  ],
  "article": [
    "It doesn’t get any more premium than the MacBook Pro 16-inch (2021). This flagship portable, which was released in October of 2021 along with its smaller counterpart, the MacBook Pro 14-inch (2021), has pushed the boundaries of what you can expect out of a professional laptop. It not only overhauls the design of 2019’s 16-inch MacBook Pro, but also adds in some great new features and an impressive amount of performance.",
    "The performance of the Apple MacBook Pro 16-inch (2021) is incredibly similar to that of the slightly more portable MacBook Pro 14-inch (2021), thanks to the fact that they sport basically the same hardware, with the new M1 Pro or M1 Max chips available for both models. The main difference is mostly due to its size since you’ll get a bigger screen and higher resolution, not to mention longer battery life.",
    "So, if you’re looking for something portable, we recommend reading our comprehensive MacBook Pro 14-inch (2021) review as that might be a better fit. Otherwise, if you care about longevity and screen real estate, the MacBook Pro 16-inch (2021) is the laptop for you.",
    "Being the larger of the two, and Apple’s flagship MacBook, it’ll come as little surprise to learn that the MacBook Pro 16-inch (2021) is a pricey laptop, starting at $2,499 (£2,399, AU$3,749) for the model with an M1 Pro chip with a 10-core CPU and 16-core GPU, with 16GB unified memory and 512GB SSD storage.",
    "If you want to upgrade to the more powerful M1 Max chip, which has a 10-core CPU, 32-core GPU, 32GB of faster memory and 1TB SSD, that’ll cost you $3,499 (£3,299, AU$5,249).",
    "The MacBook Pro 14-inch is a lot more affordable, as it starts at $1,999 / £1,899 / AU$2,999 for a model with the M1 Pro chip. However, this M1 Pro is slightly less powerful, as it has an 8-core CPU and 14-core GPU. The more powerful 14-inch model with a 10-Core CPU, 16-Core GPU M1 Pro chip, 16GB Unified Memory and 1TB SSD storage will set you back a hefty $2,499 / £2,399 / AU$3,749.",
    "Both sizes can be configured, so you can get a 14-inch with an M1 Max if you wish. If you wanted a 14-inch with the 10-core CPU, 32-core GPU, 32GB of memory and 1TB SSD, it will cost you $3,299/ £3,199/AU$4,949, which is around $200/£100/AU$300 cheaper than the similarly specced 16-inch model. That’s not a bad price considering you get a much bigger screen.",
    "Meanwhile, the 2019 model with Intel hardware and an AMD Radeon Pro graphics card started at $2,399 (£2,399, AU$3,799) for a 6-core Intel Core i7 processor, AMD Radeon Pro 5300M 4GB GPU, 16GB of RAM and a 512GB SSD. So, it’s a bit more expensive than the previous model, but the improvements Apple has made to the design and performance of the MacBook Pro 16-inch (2021) has made this jump in price justified for many people. It’s likely that there will also be people upgrading from the 16-inch 2019 model who are eying up the 14-inch MacBook Pro instead.",
    "When it comes to design, the MacBook Pro 16-inch (2021)’s biggest change is with the screen. It’s now a Liquid Retina XDR display featuring mini-LED technology that delivers up to 1,000 nits of sustained, full-screen brightness. Better still, the MacBook Pro 16-inch (2021) is capable of up to 1,600 nits of peak brightness and a 1,000,000:1 contrast ratio.",
    "The display offers P3 wide color gamut coverage and supports one billion colors for smoother gradients. Best of all, the display also comes with the expected 120Hz refresh rate, making it the fastest MacBook Pro 16-inch display yet.",
    "Because the bezels around the screen have been slimmed down for a more modern look, it's allowed Apple to increase the screen size to 16.2-inches from the 16-inches of the previous model. It also offers 7.7 million pixels thanks to its 3,546 x 2,234 resolution - which Apple says is the most ever in a MacBook.",
    "This is a decent upgrade over the MacBook Pro 16-inch (2019)’s screen, which was a 16-inch, 3,072 x 1,920 Retina display with backlit LED for up to 1,000 nits sustained brightness, and 1,600 nits peak brightness, covering a wide color P3 gamut.",
    "The 14-inch MacBook Pro’s screen is obviously smaller at 14.2-inches, with a lower resolution of 3024x1964. However, this actually results in both screens in the new MacBook Pros having identical pixel densities of 254 PPI (Pixels Per Inch), so both offer the same image quality. It then boils down to which screen size you prefer.",
    "While the 16-inch model offers a larger screen that many will feel more comfortable working on, it also means that the overall dimensions of the MacBook Pro 16-inch (2021) are much larger than the MacBook Prom 14-inch (2021). With dimensions of 0.66 x 14.01 x 9.77 inches (1.68 x 35.57 x 24.81cm), which is roughly the same as the 0.64 x 14.09 x 9.68 inches (1.62 x: 35.79 x 24.59cm) dimensions of the previous model, make no mistake: the MacBook Pro 16-inch (2021) is a big and bulky laptop, weighing 2.2 kg (4.8 pounds) for the M1 Max model (the M1 Pro version is slightly lighter at 2.1kg (4.7 pounds).",
    "If you’re after a slim and light laptop, then this ain’t it. Of course, Apple has you covered with the excellent MacBook Air (M1, 2020), which can’t compete with the MacBook Pro 16-inch when it comes to performance, but it’s thinner, lighter and much cheaper. For many people, that would be a wiser investment.",
    "Because of the large size of the MacBook Pro 16-inch, what Apple has achieved with it doesn’t feel quite as remarkable as with the 14-inch model, which packs a huge amount of power into a much smaller, and more portable, body. That may be a bit unfair to the MacBook Pro 16-inch (2021), which remains an incredibly powerful workstation laptop, but there’s something about having that power in a smaller laptop that just feels so much more impressive.",
    "However, being a chunky laptop does have its advantages. One of the most welcome additions to the MacBook Pro 16-inch (2021) is the addition of extra ports, something many of us have been bugging Apple to include in its professional laptops for a while now.",
    "So, as with the 14-inch model, the new MacBook Pro 16-inch comes with three Thunderbolt 4 ports, one HDMI port, an SDXC card slot, and a MagSafe 3 port, along with a Magic Keyboard with Touch ID, Force Touch trackpad, and a 140W USB-C power adapter (you can still charge via USB-C if you'd prefer). There's also a 3.5mm headphone jack, too.",
    "With previous MacBook Pros, Apple limited ports to a couple of USB-C slots, and while that made the laptops look sleek and slim, it wasn’t much use to professionals who need to plug in peripherals such as cameras, monitors and memory cards. Instead, they would have to invest in a USB adapter for these devices.",
    "We’re very pleased, then, with the added ports in the new MacBook Pros. For photographers, it means you can plug your camera’s memory card straight into the laptop without worrying about bringing a dongle or adapter with you. For anyone using the MacBook Pro 16-inch (2021) for presentations, they can now hook it up directly to a projector or TV via the HDMI port.",
    "It’s great that Apple is listening to customer feedback and included those, despite its inclination to put form over function for many of its products. It results in a larger and bulkier laptop, but for professionals that are after a powerful workstation laptop they can use anywhere without having to plug in additional hardware, it’s a price worth paying.",
    "One design decision that has proved controversial, however, has been the addition of a noticeable notch around the webcam that comes down into the menu bar. Many people have complained about how this looks, and there are now several apps out there designed to help hide the notch.",
    "As we mentioned in our 14-inch MacBook Pro review, while the notch is noticeable, and it’s not the most elegant solution, after a while you genuinely won’t notice that it’s there. The notch is needed, according to Apple, because of the boosted webcam (it’s now 1080p, up from previous models’ 720p cameras), and the slimmed-down bezels surrounding the screen.",
    "And, while the notch does intrude in the menu bar, the menu bar itself has actually been moved up and now takes up an area that used to be taken up by the thicker bezels of older MacBook Pros. This means you get a lot more screen space to work with, and if the notch is a price worth paying for that, then we’ll gladly accept that – and we’re sure many people will feel the same after only a short while with the new MacBook Pro 16-inch.",
    "It’s why we’re a bit baffled by these notch hiding apps, as all they do is move the menu bar further down the screen again, and blacks out the screen around the notch. This effectively reduces your screen real estate, and makes it look like the MacBook Pro 16-inch has an ugly and old-fashioned bezel again. It’s really not worth doing all of that, just because you don’t like the notch.",
    "Still, the notch and large size of the 16-inch model will mean this won’t be a laptop that will appeal to everyone, especially as the 14-inch model offers similar levels of performance but in a smaller body.",
    "Speaking of performance, the MacBook Pro 16-inch (2021) is a joy to use. The macOS Monterey operating that comes pre-installed is fast and responsive, and the M1 Pro chip inside the MacBook Pro 16-inch does an excellent job with all the creative tasks we threw at it.",
    "This involved editing numerous 8K video files in Final Cut Pro, playing around with complex musical projects in Logic Pro, and doing real-time 3D modeling and animation. The fact that the MacBook Pro 16-inch handled all this with ease – even when on battery – was incredibly impressive.",
    "The model we were sent to review comes with the same M1 Pro chip that was in the MacBook Pro 14-inch we also reviewed, so performance was extremely similar. Again, it means that the choice of whether to buy the 14-inch or the 16-inch MacBook Pro mainly boils down to budget and whether or not you want a larger screen.",
    "We’ve not had a chance to try out the MacBook Pro 16-inch (2021) with the M1 Max chip, but we will hopefully do that soon, and will update this review. That promises to offer even better performance, especially when it comes to graphical tasks, and the 16-inch MacBook Pro with the M1 Max chip also benefits from an exclusive High Power Mode which boosts performance even further, and is designed for the most intensive of tasks, such as editing raw 8K footage.",
    "This won’t be needed by everyone, but it’s worth pointing out that it’s only available with the 16-inch M1 Max MacBook Pro. Owners of the 14-inch model, or any of the models with the M1 Pro, will not be able to make use of this feature.",
    "For most creative tasks, however, we found the 16-inch MacBook Pro with the M1 Pro to be more than up to the task. It really is impressive to have desktop-class performance in a laptop, and while it’s not as portable as the 14-inch model, it’s still a laptop that you can carry around with you in reasonable comfort.",
    "As with the 14-inch, the screen of the MacBook Pro 16-inch (2021) is absolutely stunning, and the larger size really does make it more comfortable to work on. Images are crisp and vivid, and colors and brightness levels are incredible. This is by far the best screen you can get on a professional laptop right now. While it’s not the highest resolution, the technology behind it, particularly the mini LED display and adaptive refresh rate of Pro Motion, means the who package ensures your work, be it 3D models, videos or photographs, look their very best. Again, it eliminates the need to plug in an external monitor.",
    "The webcam was also excellent, offering clear and clean visuals. These days it’s important to be able to talk to customers, clients, co-workers and family over the internet, and the MacBook Pro 16-inch (2021)’s combination of improved webcam and studio-quality built-in microphones does a great job here.",
    "Battery life has also been drastically improved. Apple claims the MacBook Pro 16-inch (2021) can achieve up to 21 hours of video playback, which is 10 hours longer than the last-gen MacBook Pro 16-inch (2019). The company also promises that the laptop will last up to 14 hours when wirelessly browsing the web, which we interpret as casual to moderate use.",
    "In our battery benchmark test, which plays a looped 1080p video, the MacBook Pro 16-inch (2021) lasted a huge 18 hours and 48 minutes. That’s an incredible amount, and beats the MacBook Pro 14-inch’s results by almost three hours.",
    "The larger size of the 16-inch has allowed Apple to include a bigger battery, and that has paid off with one of the best battery lives in a laptop – especially in a device this powerful. During our time with the 16-inch MacBook Pro, we happily worked a full workday without needing to plug it in, and the fact that performance wasn’t limited when on the battery was again, very impressive. This is the first time you could use a workstation laptop for seriously demanding tasks without worrying about plugging it in.",
    "The larger size of the MacBook Pro 16-inch is a tradeoff for this longer battery life, but many people will find that’s worth it.",
    "Overall, Apple has done an excellent job creating a modern workstation laptop for creative professionals that offers brilliant performance, even when working on battery, along with the best screen you can get on a laptop right now.",
    "It’s not as portable as the 14-inch MacBook Pro, but if you want a larger screen and even longer battery, then the MacBook Pro 16-inch is the model to go for."
  ],
  "headers": {
    "0": "Five-minute review",
    "40": "Don't buy it if..."
  },
  "links": {
    "2019’s 16-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "M1 Pro or M1 Max chips": "https://www.techradar.com/news/m1-pro-vs-m1-max",
    "MacBook Pro 14-inch (2021) review": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "MacBook Air (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020"
  }
}